# StructuralAnalyticalColumnHorizontalProjectionPlane Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralAnalyticalColumnHorizontalProjectionPlane Property
ParameterTypeId Class See Also
---
"Horizontal Projection"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralAnalyticalColumnHorizontalProjectionPlane { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralAnalyticalColumnHorizontalProjectionPlane As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralAnalyticalColumnHorizontalProjectionPlane {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace